xboot/xboot/src/arch/riscv64/mach-k210/include/k210-irq.h
#ifndef __K210_IRQ_H__
#define __K210_IRQ_H__

#ifdef __cplusplus
extern "C" {
#endif

#define K210_IRQ_NONE		(0)
#define K210_IRQ_SPI0		(1)
#define K210_IRQ_SPI1		(2)
#define K210_IRQ_SPI_SLAVE	(3)
#define K210_IRQ_SPI3		(4)
#define K210_IRQ_I2S0		(5)
#define K210_IRQ_I2S1		(6)
#define K210_IRQ_I2S2		(7)
#define K210_IRQ_I2C0		(8)
#define K210_IRQ_I2C1		(9)
#define K210_IRQ_I2C2		(10)
#define K210_IRQ_UART1		(11)
#define K210_IRQ_UART2		(12)
#define K210_IRQ_UART3		(13)
#define K210_IRQ_TIMER0A	(14)
#define K210_IRQ_TIMER0B	(15)
#define K210_IRQ_TIMER1A	(16)
#define K210_IRQ_TIMER1B	(17)
#define K210_IRQ_TIMER2A	(18)
#define K210_IRQ_TIMER2B	(19)
#define K210_IRQ_RTC		(20)
#define K210_IRQ_WDT0		(21)
#define K210_IRQ_WDT1		(22)
#define K210_IRQ_GPIO		(23)
#define K210_IRQ_DVP		(24)
#define K210_IRQ_AI			(25)
#define K210_IRQ_FFT		(26)
#define K210_IRQ_DMA0		(27)
#define K210_IRQ_DMA1		(28)
#define K210_IRQ_DMA2		(29)
#define K210_IRQ_DMA3		(30)
#define K210_IRQ_DMA4		(31)
#define K210_IRQ_DMA5		(32)
#define K210_IRQ_UARTHS		(33)

#define K210_IRQ_GPIOHS0	(34)
#define K210_IRQ_GPIOHS1	(35)
#define K210_IRQ_GPIOHS2	(36)
#define K210_IRQ_GPIOHS3	(37)
#define K210_IRQ_GPIOHS4	(38)
#define K210_IRQ_GPIOHS5	(39)
#define K210_IRQ_GPIOHS6	(40)
#define K210_IRQ_GPIOHS7	(41)
#define K210_IRQ_GPIOHS8	(42)
#define K210_IRQ_GPIOHS9	(43)
#define K210_IRQ_GPIOHS10	(44)
#define K210_IRQ_GPIOHS11	(45)
#define K210_IRQ_GPIOHS12	(46)
#define K210_IRQ_GPIOHS13	(47)
#define K210_IRQ_GPIOHS14	(48)
#define K210_IRQ_GPIOHS15	(49)
#define K210_IRQ_GPIOHS16	(50)
#define K210_IRQ_GPIOHS17	(51)
#define K210_IRQ_GPIOHS18	(52)
#define K210_IRQ_GPIOHS19	(53)
#define K210_IRQ_GPIOHS20	(54)
#define K210_IRQ_GPIOHS21	(55)
#define K210_IRQ_GPIOHS22	(56)
#define K210_IRQ_GPIOHS23	(57)
#define K210_IRQ_GPIOHS24	(58)
#define K210_IRQ_GPIOHS25	(59)
#define K210_IRQ_GPIOHS26	(60)
#define K210_IRQ_GPIOHS27	(61)
#define K210_IRQ_GPIOHS28	(62)
#define K210_IRQ_GPIOHS29	(63)
#define K210_IRQ_GPIOHS30	(64)
#define K210_IRQ_GPIOHS31	(65)

#define K210_IRQ_GPIO0		(66)
#define K210_IRQ_GPIO1		(67)
#define K210_IRQ_GPIO2		(68)
#define K210_IRQ_GPIO3		(69)
#define K210_IRQ_GPIO4		(70)
#define K210_IRQ_GPIO5		(71)
#define K210_IRQ_GPIO6		(72)
#define K210_IRQ_GPIO7		(73)

#ifdef __cplusplus
}
#endif

#endif /* __K210_IRQ_H__ */
